src/Performance-Test/problem-solving/temp-becnhmark.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ps-iiith.vlabs.ac.in (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        ps-iiith.vlabs.ac.in
Server Port:            80

Document Path:          /
Document Length:        12038 bytes

Concurrency Level:      190
Time taken for tests:   1.689 seconds
Complete requests:      1500
Failed requests:        0
Total transferred:      18501000 bytes
HTML transferred:       18057000 bytes
Requests per second:    888.27 [#/sec] (mean)
Time per request:       213.899 [ms] (mean)
Time per request:       1.126 [ms] (mean, across all concurrent requests)
Transfer rate:          10699.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2   14  72.6      9    1007
Processing:     6  180 234.2    146    1679
Waiting:        5  179 234.1    145    1678
Total:          8  194 244.8    155    1686

Percentage of the requests served within a certain time (ms)
  50%    155
  66%    156
  75%    157
  80%    157
  90%    158
  95%    161
  98%   1649
  99%   1672
 100%   1686 (longest request)